--- javascript

1. 정수로 된 배열 두 개가 있다. 이 두 배열중 같은 수가 하나라도 있다면 true를 없으면 false를 출력하라.


2. 임의의 문자열이 소문자 사이에 대문자가 있거나 대문자 사이에 소문자가 있는지 확인하는 스크립트를 작성하라.

예) xYz ==> true  XyZ==> true


3. 양의정수를 받아 한자리를 삭제했을때 최대 숫자가 남도록 스크립트를 작성하라.

예) 100 ==> 10    576==> 76

 

4. 임의의 숫자를 한 자리 수로 변환될때 까지 계속 더하는 스크립트를 작성하라.

예 1234 ==> 1+2+3+4 +5 = 15 ==> 1 + 5 = 최종 6

--- java

5.두 숫자 74와 36의 합을 출력하라.

6. 숫자50을 3으로 나누어 결과를 화면에 출력하라. 단 결과는 정수이다.


7. 다음 결과를 출력하라.

  1) -5 + 8 * 6

  2) (55 + 9) % 9

  3) 20 + 3*5/8

  4) 5+15/3*2-8%3


8. 99단을 1부터 9까지 출력하라.    